<?php
$backup_site_url = "https://github.com/admin-ll55/SDGO_DB/wiki/Backup-Sites-%7C-%E5%BE%8C%E5%82%99%E7%B6%B2%E5%9D%80-%7C-%E5%90%8E%E5%A4%87%E7%BD%91%E5%9D%80";
$source_url = "https://github.com/admin-ll55/SDGO_DB";
?>
2019/06/15
::
<?=tos("更新圖片，按","更新图片，按")?>
<a class='button'>Ctrl</a><a class='button'>F5</a>
<?=tos("刷新圖片","刷新图片")?>
(24429 24601 24603 24605 24607 24700 24702)
||
<?=tos("新增「濺射」武器效果","新增「溅射」武器效果")?>
||
<?=tos("「變型」取代「特性」","「变型」取代「特性」")?>
||
<?=tos("新增「小型」特殊選項","新增「小型」特殊选项")?>
;
2019/06/12
::
<?=tos("rfgd網域被炸，目前已改用heroku","rfgd网域被炸，目前已改用heroku")?>
||
<?=tos("新增格鬥段數和倒地<lt>值</lt>數量","新增格斗段数和倒地<lt>值</lt>数量")?>
;
2019/06/08
::
<?=tos("新增「每日精選」","新增「每日精选」")?>
||
<?=tos("更新跨域SQL和PHP效能","更新跨域SQL和PHP效能")?>
;
2019/06/07
::
<?=tos("新增「自定義扭蛋機」","新增「自定义扭蛋机」")?>
;
2019/06/06
::
<?=tos("新增「設計圖追溯」功能","新增「设计图追溯」功能")?>
||
<?=tos("新增武器類別和效果選項","新增武器类别和效果选项")?>
||
<?=tos("新增特殊選項","新增特殊选项")?>
||
<?=tos("更新六圍數據","更新六围数据")?>
||
<?=tos("全新首頁界面","全新首页界面")?>
;
<?=tos("關於本站","关於本站")?>
::
<?=tos("網頁及數據更新進度","网页及数据更新进度")?>：40%
||
<?=tos("網頁源碼","网页源码")?>：<a class='button' href='<?=$source_url?>' target='blank'><?=tos("點擊查看","点击查看")?></a>
||
<?=tos("聯絡電郵","联络电邮")?>：<input type='text' content='dmca' value='contact@sdgo2018.rf.gd' size='21' />
;
