<?php
if (!function_exists("tos")) {
  require_once "inc/php/tos.php";
  header("Content-Type: text/plain");
}
$backup_site_url = "https://github.com/admin-ll55/SDGO_DB/wiki/Backup-Sites-%7C-%E5%BE%8C%E5%82%99%E7%B6%B2%E5%9D%80-%7C-%E5%90%8E%E5%A4%87%E7%BD%91%E5%9D%80";
$source_url = "https://github.com/admin-ll55/SDGO_DB";
?>

2019/06/24
::
<?=tos("改用000wh、更新電郵、主要網域","改用000wh、更新电邮、主要网域")?>

||
<?=tos("有關詳情請看關於本站","有关详情请看关於本站")?>

;

2019/06/17
::
<?=tos("更新首頁、設計圖頁面效能(仍有待提升)","更新首页、设计图页面效能(仍有待提升)")?>

;
2019/06/16
::
<?=tos("移動版網頁：新增武器表格首列置頂功能","移动版网页：新增武器表格首列置顶功能")?>

||
<?=tos("新增武器類別鏈接","新增武器类别链接")?>

(武器圖片右下角的<img class="weapon" srcc="s" /> <img class="weapon" srcc="m" /> <img class="weapon" srcc="l" /> <img class="weapon" srcc="f" />)
||
<?=tos("新增機體比較詳細數據(可用","新增机体比较详细数据(可用")?>

<a class="button">←</a><a class="button">→</a>
<?=tos("移動比較表格)","移动比较表格)")?>

||
<?=tos("「近、中、遠」取代", "「近、中、远」取代")?>

「<img class="pos" srcc="r" />、<img class="pos" srcc="s" />、<img class="pos" srcc="p" />」
||
<?=tos("修正meta標籤、分類、扭蛋機頁面", "修正meta标签、分类、扭蛋机页面")?>

;
2019/06/15
::
<?=tos("更新圖片，按","更新图片，按")?>

<a class='button'>Ctrl</a><a class='button'>F5</a>
<?=tos("刷新圖片","刷新图片")?>

(24429 24601 24603 24605 24607 24700 24702)
||
<?=tos("新增「濺射」武器效果","新增「溅射」武器效果")?>

||
<?=tos("「變型」取代「特性」","「变型」取代「特性」")?>

||
<?=tos("新增「小型」特殊選項","新增「小型」特殊选项")?>

;
2019/06/12
::
<?=tos("rfgd網域被炸，目前已改用heroku","rfgd网域被炸，目前已改用heroku")?>

||
<?=tos("新增格鬥段數和倒地<lt>值</lt>數量","新增格斗段数和倒地<lt>值</lt>数量")?>

;
2019/06/08
::
<?=tos("新增「每日精選」","新增「每日精选」")?>

||
<?=tos("更新跨域SQL和PHP效能","更新跨域SQL和PHP效能")?>

;
2019/06/07
::
<?=tos("新增「自定義扭蛋機」","新增「自定义扭蛋机」")?>

;
2019/06/06
::
<?=tos("新增「設計圖追溯」功能","新增「设计图追溯」功能")?>

||
<?=tos("新增武器類別和效果選項","新增武器类别和效果选项")?>

||
<?=tos("新增特殊選項","新增特殊选项")?>

||
<?=tos("更新六圍數據","更新六围数据")?>

||
<?=tos("全新首頁界面","全新首页界面")?>

;
<?=tos("關於本站","关於本站")?>

::
<?=tos("未來一個月只在周末更新，進度會很慢","未来一个月只在周末更新，进度会很慢")?>
||
<?=tos("網頁及數據更新進度","网页及数据更新进度")?>：40%
||
<?=tos("過去公告","过去公告")?>：<a class='button' href='rss' target='blank'><?=tos("點擊查看","点击查看")?></a>
||
<?=tos("備用網頁、源碼","备用网页、源码")?>：<a class='button' href='<?=$source_url?>' target='blank'><?=tos("點擊查看","点击查看")?></a>
||
<?=tos("聯絡電郵","联络电邮")?>：<input type='text' content='dmca' value='ct-sdgo@mail.ru' size='14' />
;
